nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/vdrnew.c
	return 0;
}

/*更新行车记录仪数据*/
void thread_usb_vdr( void* parameter )
{
	int			i, res;
	int			count = 0;
	uint8_t		buf[520];
	uint32_t	addr;
	int			fd = -1;
	uint8_t		*p;
/*查找U盘*/
	if( rt_device_find( "udisk" ) == RT_NULL ) /*没有找到*/
	{
		rt_kprintf( "\r\nVDR>没有UDISK" );
		return;
	}

/*查找指定文件*/

	p		= (uint8_t*)parameter;
	addr	= *p++ << 24;
	addr	|= *p++ << 16;
	addr	|= *p++ << 8;
	addr	|= *p++;
	rt_kprintf( "\r\nusb write to %08x", addr );
	strcpy( (char*)buf, "/udisk/" );
	strcat( (char*)buf, p );


/*
   addr=0x00300000;
   strcpy(buf,"/udisk/vdr.bin");
 */
	fd = open( buf, O_RDONLY, 0 );
	if( fd >= 0 )
	{
		rt_kprintf( "\r\nVDR>读取文件" );
	} else
	{
		rt_kprintf( "\r\nVDR>文件不存在" );
		return;
	}
/*写入*/

	while( 1 )
	{
		WatchDog_Feed( );
		rt_thread_delay( RT_TICK_PER_SECOND / 5 );
		res = read( fd, buf, 512 );
		if( res < 0 )
		{
			rt_kprintf( "\r\nVDR>读取文件出错，res=%x", res );
			goto end_upgrade_usb_1;
		}else
		{
			if( res == 0 )
			{
				rt_kprintf( "\r\nVDR>写入完成 %d byte", count );
				goto end_upgrade_usb_1;
			}
			/*写入数据*/
			count += res;
			if( ( addr & 0x0FFF ) == 0 )
			{
				SST25V_SectorErase_4KByte( addr );
				//sst25_erase_4k
			}

			for( i = 0; i < 512; i++ )
			{
				SST25V_ByteWrite( buf[i], addr );
				addr++;
			}

			//sst25_write_through( add, uint8_t *p, uint16_t len)
			rt_kprintf( "\r\nVDR>写入 %d byte", count );
			if( res < 512 )
			{
				rt_kprintf( "\r\nVDR>写入完成 %d byte", count );
				goto end_upgrade_usb_1;
			}
		}
	}
end_upgrade_usb_1:
	if( fd >= 0 )
	{
		close( fd );
	}
}

/*
   调试vdr

   vdr_cmd(0x09,"12:34:56","13:11:03",1)

 */
uint8_t vdr_start( uint8_t cmd, char *start, char *end, uint16_t blocks )
{
	int h, m, s;
	fvdr_debug = 1;

	sscanf( start, "%d:%d:%d", &h, &m, &s );
	vdr_cmd.ymdh_start		= h;
	vdr_cmd.minute_start	= m;

	sscanf( end, "%d:%d:%d", &h, &m, &s );
	vdr_cmd.ymdh_end	= h;
	vdr_cmd.minute_end	= m;

	vdr_cmd.blocks			= blocks;
	vdr_cmd.blocks_remain	= blocks;

	vdr_cmd.ymdh_curr = vdr_cmd.ymdh_end;

	vdr_cmd.cmd = cmd;

	switch( cmd )
	{
		case 0x08: vdr_cmd.addr = 0x00300000; vdr_get_08h( ); break;
		case 0x09: vdr_get_09h( ); break;
		case 0x10: vdr_get_10h( ); break;
		case 0x11: vdr_get_11h( ); break;
		case 0x12: vdr_get_12h( ); break;
		case 0x13: vdr_get_13h( ); break;
		case 0x14: vdr_get_14h( ); break;
		case 0x15: vdr_get_15h( ); break;
	}
}

FINSH_FUNCTION_EXPORT( vdr_start, debug vdr );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void vdr_import( uint32_t addr, char* filename )
{
	file_rec[0] = addr >> 24;
	file_rec[1] = addr >> 16;
	file_rec[2] = addr >> 8;
	file_rec[3] = addr & 0xFF;
	strcpy( file_rec + 4, filename );

	tid_usb_vdr = rt_thread_create( "usb_vdr", thread_usb_vdr, (void*)&file_rec, 1024, 9, 5 );
	if( tid_usb_vdr != RT_NULL )
	{
		rt_kprintf( "线程创建成功" );
		rt_thread_startup( tid_usb_vdr );
	}else
	{
		rt_kprintf( "线程创建失败" );
	}
}

FINSH_FUNCTION_EXPORT( vdr_import, import vdr );

#define DBG_VDR

#ifdef DBG_VDR
static uint8_t testbuf[1000];
#endif


/*
   行驶速度记录
   不管他，自己填数据，自己报
   单条126字节每分钟
   48*60=2880包

   每5条 组一包  630字节
   每6条 组一包  756字节
 */

uint8_t get_08h( uint8_t *pout )
{
	static uint8_t	month_08 = 4, day_08 = 30, hour_08 = 0, min_08 = 0;

	static uint32_t addr_08		= VDR_08H_09H_START;
	static uint32_t count_08	= 0;
	uint8_t			buf[128], data[135];
	uint8_t			*p = RT_NULL, *pdump;
	int				i, j, k;
#ifdef DBG_VDR
	p = testbuf;
#else
	p = pout;
#endif

	for( i = 0; i < 5; i++ )
	{
		addr_08=0x00300000+hour_08*8192+min_08*128+128;
		if( addr_08 >= VDR_08H_09H_END )
		{
			addr_08 = VDR_08H_09H_START+128;
		}
		
		SST25V_BufferRead( buf, addr_08, 128 );
		decompress_data( buf, data );
		buf[0]	= HEX_TO_BCD( 13 );         /*year*/
		buf[1]	= HEX_TO_BCD( month_08 );   /*month*/
		buf[2]	= HEX_TO_BCD( day_08 );     /*day*/
		buf[3]	= HEX_TO_BCD( hour_08 );    /*hour*/
		buf[4]	= HEX_TO_BCD( min_08 );     /*miniute*/
		buf[5]	= HEX_TO_BCD( 0 );          /*sec*/

		for( j = 0; j < 60; j++ )
		{
			buf[j * 2 + 6]	= data[j];
			buf[j * 2 + 7]	= data[60 + j];
		}
		memcpy( pout + i * 126, buf, 126 );

		count_08++;
		if( min_08 == 0 )
		{
			min_08 = 59;
			if( hour_08 == 0 )
			{
				day_08--;
				hour_08 = 24;
			}
			hour_08--;
		}else
		{
			min_08--;
		}

#ifdef  DBG_VDR                                       /*调试输出*/
		pdump = buf;
		rt_kprintf( "\r\nVDR>08H(%d) 13-%02d-%02d %02d:%02d \r\n", count_08, month_08, day_08, hour_08, min_08 );
		for( j = 0; j < 6; j++ )
		{
			rt_kprintf( "%02x ", *pdump++ );
		}
		for( j = 0; j < 6; j++ )
		{
			rt_kprintf( "\r\n>" );
			for( k = 0; k < 20; k++ )
			{
				rt_kprintf( "%02x ", *pdump++ );
			}
		}
#endif
		addr_08 += 128;
	}
	return 126 * 6;
}

FINSH_FUNCTION_EXPORT( get_08h, get_08 );


/*
   位置信息
   360小时   ，每小时666字节
 */

uint8_t get_09h( uint8_t *pout )
{
	static uint8_t	month_09 = 4, day_09 = 30, hour_09 = 23;

	static uint32_t addr_09		= VDR_08H_09H_START;
	static uint32_t count_09	= 0;
	uint8_t			buf[128], data[135];
	uint8_t			*p = RT_NULL;
	int				i, j, k;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_09 >= VDR_08H_09H_END )
	{
		addr_09 = VDR_08H_09H_START;
	}

	if( ( addr_09 & 0x1FFF ) == 0 )
	{
		addr_09 += 128;                 /*避开小时的头*/
	}

	*p++	= HEX_TO_BCD( 13 );         /*year*/
	*p++	= HEX_TO_BCD( month_09 );   /*month*/
	*p++	= HEX_TO_BCD( day_09 );     /*day*/
	*p++	= HEX_TO_BCD( hour_09 );    /*hour*/
	*p++	= HEX_TO_BCD( 0 );          /*miniute*/
	*p++	= HEX_TO_BCD( 0 );          /*sec*/

	for( i = addr_09; i < addr_09 + ( 60 * 128 ); i += 128 )
	{
		SST25V_BufferRead( buf, i, 128 );
		decompress_data( buf, data );
		for( j = 0; j < 60; j++ )
		{
			if( data[60 + j] & 0x01 )   /*看是不是有速度*/
			{
				break;
			}
		}
		if( j < 60 )
		{
			for( k = 0; k < 10; k++ )   /*位置信息*/
			{
				*p++ = data[120 + k];
			}
			*p++ = data[j];             /*速度*/
		}else
		{
			memcpy( p, "\x7F\xFF\xFF\xFF\x7F\xFF\xFF\xFF\x00\x00\x00", 11 );
			p += 11;
		}
	}
	addr_09 += 8192;
#ifdef  DBG_VDR
	rt_kprintf( "\r\nVDR>09H(%d) 13-%02d-%02d %02d \r\n", count_09, month_09, day_09, hour_09 );
	p = pout;
	for( i = 0; i < 6; i++ )
	{
		rt_kprintf( "%02x ", *p++ );
	}
	for( i = 0; i < 60; i++ )
	{
		rt_kprintf( "\r\n>" );
		for( j = 0; j < 11; j++ )
		{
			rt_kprintf( "%02x ", *p++ );
		}
	}
#endif
	return 666;
}

FINSH_FUNCTION_EXPORT( get_09h, get_09 );


